---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.InvalidArrayObject
source: html/964846c9-927f-74dd-0fe4-ca83da8c01ed.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.InvalidArrayObject Property

Some or all of the selected objects can't be created in an Array (for example, a Camera object for a 3D View).

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidArrayObject { get; }
```